int main()
{
    float days;
    cout << "შემოიტანეთ წელიწადში არსებული დღეების რაოდენობა (364 ან 366) " << endl;
    cin >> days;
    
    if((days >= 365) && (days <= 366) && ((days / 365) == 1)){
        cout << "არ არის ნაკიანი წელიწადი " << endl;
    } else if((days >= 365) && (days <= 366) && ((days / 365) != 1)) {
        cout << "არის ნაკიანი წელიწადი " << endl;
    } else {
        cout << "შემოიტანეთ სრული წელიწადის შესაძლო დღეების რაოდენობა " << endl;
    }
    
    return 0;
}

// float days იმიტომ, რომ თუ 366 დღე იქნებოდა შემოტანილი მეცხრე ხაზზე გაყოფისას სრული მნიშვნელობა არ დაებრუნებინა რაც შედეგად შეცდომას მოგვცემდა.