#include <iostream>

using namespace std;

int main()
{
    float a, b, c;
    cout << "შემოიტანეთ პირველი რიცხვი" << endl;
    cin >> a;
    cout << "შემოიტანეთ მეორე რიცხვი" << endl;
    cin >> b;
    cout << "შემოიტანეთ მესამე რიცხვი" << endl;
    cin >> c;
    
    if((a > b) && (a > c)){
        cout << a << "არის მაქსიმალური მათ შორის" <<endl;
    } else if((b > a) && (b > c)){
        cout << b << "არის მაქსიმალური მათ შორის" << endl;
    } else if((c > a) && (c > b)){
        cout << c << "არის მაქსიმალური მათ შორის" << endl;
    } else {
        cout << "შემოიტანეთ განსხვავებული მნიშვნელობები" << endl;
    }
    
    return 0;
}

// თუ პირველს რომელიმე სიმბოლოს ჩავწერთ კოდი ვერ ახერხებს სხვა მნიშვნელობების შეტანასაც ///